puts "------------------------------------"
puts "Решим квадратное уравнение: ах^2 + bx + c = 0"
puts "Введите первый коэффициент: а"
a = gets.chomp.to_f
puts "Введите второй коэффициент: b"
b = gets.chomp.to_f
puts "Введите свободный член: c"
c = gets.chomp.to_f
D = (b**2 - 4*a*c).to_f
puts "Дискриминант равен #{D}"
puts "------------------------------------"
puts "Уравнение корней не имеет" if (D < 0) 
puts "Один корень уравнения: #{(-b/2)*a}" if (D == 0) 
if D > 0
   D1 = Math.sqrt(D)
   x1 = (-b + D1)/(2*a)
   x2 = (-b - D1)/(2*a)
   puts "Корни уравнения #{x1} и #{x2}"
end

  
